[
  {
    "title": "Advanced MERN Todo Manager",
    "description": "A smart Todo app with categories, reminders, dark mode, and full CRUD with backend sync.",
    "imageUrl": "https://images.unsplash.com/photo-1557683316-973673baf926",
    "tags": ["React", "Node.js", "Express", "MongoDB", "Tailwind CSS"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Users needed a more advanced Todo system with multiple lists, reminders, and auto-sync between devices. Maintaining clean state while syncing with a live backend was tricky.",
    "solution": "Built a modular React UI with category-based todos and optimistic UI updates. Backend built using Express + MongoDB stored all tasks with timestamps and reminder flags. Implemented throttling to prevent duplicate writes and added JWT-based login so users can sync todos across devices."
  },
  {
    "title": "E-Shop Admin Panel",
    "description": "A production-grade e-commerce admin dashboard with full CRUD operations, analytics, and secure authentication.",
    "imageUrl": "https://images.unsplash.com/photo-1542744173-8e7e53415bb0",
    "tags": [
      "React",
      "Express",
      "MongoDB",
      "Tailwind CSS",
      "JWT",
      "Cloudinary"
    ],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Needed a protected dashboard with multi-role access, image uploads, product filtering, and secure API endpoints. Handling large product datasets created bottlenecks.",
    "solution": "Implemented a robust Express API with access + refresh tokens. Added Cloudinary image uploads and built pagination + indexing for fast MongoDB queries. The React admin UI includes tables, analytics charts, protected routes, and form validations."
  },
  {
    "title": "TaskFlow Kanban Board",
    "description": "A Trello-like drag-and-drop Kanban workflow app with board sharing and real-time updates.",
    "imageUrl": "https://images.unsplash.com/photo-1521791055366-0d553872125f",
    "tags": ["React", "Node.js", "Express", "MongoDB", "React DnD", "JWT"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Drag-and-drop actions needed to be synced instantly with the backend without breaking column or card order. Multiple users editing the same board created conflicts.",
    "solution": "Used React Beautiful DnD with optimistic UI updates and atomic MongoDB operations to maintain ordering. Added JWT authentication + board-level permissions. Designed a clean REST API for stable real-time syncing."
  },
  {
    "title": "DineEase Restaurant Website",
    "description": "A modern restaurant website with online reservations, menu management, and an interactive admin dashboard.",
    "imageUrl": "https://images.unsplash.com/photo-1504674900247-0877df9cc836",
    "tags": [
      "React",
      "Node.js",
      "Express",
      "MongoDB",
      "Tailwind CSS",
      "Framer Motion"
    ],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "The restaurant wanted real-time table booking with blackout times and admin control. Managing menu items and reservation slots dynamically was complex.",
    "solution": "Built a fully dynamic reservation system with availability logic and server-side conflict checks. Admins can add/update menu items, track bookings, and manage special offers. Used Framer Motion for premium UI transitions."
  },
  {
    "title": "SolarVision: Interactive Solar System",
    "description": "A 3D interactive solar system model connected to a real-time NASA API for live planet data.",
    "imageUrl": "https://images.unsplash.com/photo-1580428180163-3a2a5c9e266b",
    "tags": ["React", "Three.js", "Node.js", "Express", "NASA API"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Rendering accurate 3D models in browser while fetching real NASA data caused performance and API rate-limit issues.",
    "solution": "Used Three.js for lightweight 3D rendering and built a Node proxy API to cache NASA data hourly, reducing rate limits. Added orbit animations and real-time stats for planets using React state."
  },
  {
    "title": "BookNest Library CMS",
    "description": "A digital library system with book management, user roles, reviews, and borrow/return tracking.",
    "imageUrl": "https://images.unsplash.com/photo-1521587760476-6c12a4b040da",
    "tags": ["React", "Express", "MongoDB", "Tailwind CSS", "JWT"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Needed a complete CMS where admins manage books and users can borrow or review them. Creating secure role separation (admin vs. reader) was difficult.",
    "solution": "Built role-based authentication, protected admin sections, and borrow-history tracking. Created a clean React UI with categories, search filters, and review forms. Backend ensures a book cannot be borrowed twice simultaneously."
  },
  {
    "title": "QuickVerse Multi-API Dashboard",
    "description": "A dashboard combining Google Books, Quotes, and Dictionary APIs with resilient error handling.",
    "imageUrl": "https://images.unsplash.com/photo-1545239351-1141bd82e8a6",
    "tags": ["Bootstrap", "JavaScript", "HTML", "Node.js"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Multiple third-party APIs had inconsistent data formats and frequent failures, causing UI breaks.",
    "solution": "Used Promise.allSettled to stabilize API calls, normalized all responses, and built a Node proxy server to handle CORS and caching. The UI loads even if one API fails."
  },
  {
    "title": "MERN BlogSphere",
    "description": "A modern blogging platform with markdown editor, user authentication, comments, and tags.",
    "imageUrl": "https://images.unsplash.com/photo-1515378791036-0648a3ef77b2",
    "tags": ["React", "Node.js", "Express", "MongoDB", "Tailwind CSS", "JWT"],
    "liveLink": "https://example.com",
    "githubLink": "https://github.com/Aayush8113",
    "challenge": "Needed a secure CMS where writers can publish, update, and manage blogs. Handling markdown, media uploads, and comment spam was challenging.",
    "solution": "Added a markdown editor, JWT authentication, protected author areas, server-side validation, and a spam filter. Used MongoDB text indexing for fast blog search and category filtering."
  }
]
